app/Controllers/Listado_Productos.php

    public function listarProductos()
    {
        $datosProductos['productos'] = $this->productos->findAll();
        $datosProductos['categorias'] = $this->categorias->findAll();
---
SELECT *
FROM `productos`
SELECT *
FROM `categorias`