app/Controllers/Producto_controller.php

public function singleproducto($id = null){

    $productoModel = new productos_Model();
    $data['old'] = $productoModel->where('id', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id` = '20'
 LIMIT 1