app/Controllers/Producto_controller.php

SELECT *
FROM `productos`
WHERE `id` = '20'
 LIMIT 1
---
    public function editar($id = null)
    {
        $producto = $this->productoModel->find($id);