app/Controllers/Usuario_Controller.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'admin'
 LIMIT 1
---
    public function inicioSesion() {
        if ($_SERVER["REQUEST_METHOD"] == "POST") {
            $critValidacion = $this->validate([
                "usuario"    => "required",
                "contraseña" => "required"
            ], [
                "usuario" => ["required" => 'Campo de usuario obligatorio'],
                "contraseña" => ["required" => 'Campo de contraseña obligatorio']
            ]);

            if ($critValidacion) {
                $userModel = new usuarios_model();
                $datosUser = $userModel->where('usuario', $_POST['usuario'])->first();

SELECT *
FROM `usuarios`
WHERE `baja` = 'NO'
---
    public function index() {
        $modelo = new usuarios_model();
        $data['usuarios'] = $modelo->where('baja', 'NO')->findAll();

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id_usuario` = '1'
---
    public function editar($id = null) {
        $modelo = new usuarios_model();
        $data['usuario'] = $modelo->where('id_usuario', $id)->first();