app/Controllers/ventasCabecera_controller.php

    public function listarVentas()
    {
        $ventaModel = new ventasCabecera_model();

        $ventas = $ventaModel->select('ventas_cabecera.*, usuarios.nombre, usuarios.apellido')
                             ->join('usuarios', 'usuarios.id_usuario = ventas_cabecera.usuario_id')
                             ->orderBy('fecha', 'DESC')
                             ->findAll();
---
SELECT `ventas_cabecera`.*, `usuarios`.`nombre`, `usuarios`.`apellido`
FROM `ventas_cabecera`
JOIN `usuarios` ON `usuarios`.`id_usuario` = `ventas_cabecera`.`usuario_id`
ORDER BY `fecha` DESC