app/Models/productos_model.php

    public function getProductos() {
        return $this->findAll();
---
SELECT *
FROM `productos`